performance-test-reports/5/merge/12532234725/1/user-login/user_login/run.log
-    █ setup

-      █ Given Multiple Users Can access the system

-    █ And [Auth Service] Login Endpoint is accessible

-      █ When more than 10 users are trying to login at the same time

-        ✓ test start time : 2024-12-29T03:50:36Z
-        ✓ request url : http://localhost:5500/client_login
-        ✗ response status : 200
-         ↳  98% — ✓ 332644 / ✗ 6737
-        ✓ response: isJson
-        ✓ Mock N/A
-        ✓ response error : none
-        ✗ response error : 
		status-->0
		error-->read: connection reset by peer
-         ↳  0% — ✓ 0 / ✗ 1977
-        ✗ response error : 
		status-->0
		error-->dial: i/o timeout
-         ↳  0% — ✓ 0 / ✗ 1578
-        ✗ response error : 
		status-->0
		error-->request timeout
-         ↳  0% — ✓ 0 / ✗ 3182

-      █ Then the system should be able to handle the load and respond with status 200

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 332644 / ✗ 6737
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-      █ And verify the load test client should find the breaking point

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 332644 / ✗ 6737
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-    _response_errors_cnt...........: 6737    7.847311/s
-    _response_success_cnt..........: 332644  387.466373/s
-    _response_total_cnt............: 339381  395.313684/s
-    checks.........................: 99.33%  ✓ 4018676     ✗ 26948 
-    data_received..................: 118 MB  137 kB/s
-    data_sent......................: 79 MB   92 kB/s
-    dropped_iterations.............: 1622648 1890.073278/s
-    group_duration.................: avg=905.09ms min=232.5µs med=2.49ms   max=1m1s     p(90)=1.27s    p(95)=2.49s   
-    http_req_blocked...............: avg=453.43ms min=0s      med=174.36µs max=19.58s   p(90)=1.03s    p(95)=2.05s   
-    http_req_connecting............: avg=453.36ms min=0s      med=135.41µs max=19.58s   p(90)=1.03s    p(95)=2.05s   
-  ✗ http_req_duration..............: avg=1.21s    min=0s      med=247.67ms max=1m0s     p(90)=714.8ms  p(95)=1.41s   
-      { expected_response:true }...: avg=527.39ms min=1.35ms  med=247.34ms max=58.88s   p(90)=647.66ms p(95)=1.12s   
-  ✗ http_req_failed................: 1.98%   ✓ 6737        ✗ 332644
-    http_req_receiving.............: avg=1.22ms   min=0s      med=86.87µs  max=590.79ms p(90)=1.34ms   p(95)=3.15ms  
-    http_req_sending...............: avg=767.44µs min=0s      med=34.02µs  max=221.31ms p(90)=202.5µs  p(95)=837.26µs
-    http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=1.21s    min=0s      med=247.06ms max=1m0s     p(90)=709.91ms p(95)=1.41s   
-    http_reqs......................: 339381  395.313684/s
-    iteration_duration.............: avg=1.81s    min=3.42ms  med=255.05ms max=1m1s     p(90)=2.49s    p(95)=5.01s   
-    iterations.....................: 339381  395.313684/s
-    vus............................: 8       min=0         max=1000
-    vus_max........................: 1000    min=369       max=1000